---
## 4. Exercises

In [1]:
  # Preaparing the database for the exercises

# We will create a database with 3 tables: Students, Subjects and Classrooms

import os
import sqlite3
import pandas as pd

if "university.db" in os.listdir ( ) :
    os.remove ( "university.db" )

if "university.db" not in os.listdir ( ) :
    print ( "Creating database..." )

    # Connect to SQLite database (or create it)
    connection = sqlite3.connect ( "university.db" )

    # Create cursor object
    cursor = connection.cursor ( )

    # Create Students table
    cursor.execute ( """
    CREATE TABLE IF NOT EXISTS Students (
        Student_ID INTEGER PRIMARY KEY,
        Student_Name TEXT,
        Age INTEGER,
        Program_ID INTEGER,
        FOREIGN KEY (Program_ID) REFERENCES Programs(Program_ID)
    )
    """ )

    # Create Programs table
    cursor.execute ( """
    CREATE TABLE IF NOT EXISTS Programs (
        Program_ID INTEGER PRIMARY KEY,
        Program_Name TEXT,
        Coordinator_Name TEXT,
        Classrooms_ID INTEGER,
        FOREIGN KEY (Classrooms_ID) REFERENCES Classrooms(Classroom_ID)
    )
    """ )

    # Create Classrooms table
    cursor.execute ( """
    CREATE TABLE IF NOT EXISTS Classrooms (
        Classroom_ID INTEGER PRIMARY KEY,
        Capacity INTEGER,
        TV_Monitors INTEGER
    )
    """ )

    # Insert data into Students table
    cursor.execute ( "INSERT INTO Students VALUES (1, 'John Doe', 25, 1)" )
    cursor.execute ( "INSERT INTO Students VALUES (2, 'Jane Doe', 21, 1)" )
    cursor.execute ( "INSERT INTO Students VALUES (3, 'Mike Smith', 26, 2)" )
    cursor.execute ( "INSERT INTO Students VALUES (4, 'Emma Johnson', 19, 2)" )
    cursor.execute ( "INSERT INTO Students VALUES (5, 'Oliver Brown', 24, 2)" )
    cursor.execute ( "INSERT INTO Students VALUES (6, 'Sophia Williams', 36, 3)" )
    cursor.execute ( "INSERT INTO Students VALUES (7, 'James Jones', 45, 3)" )
    cursor.execute ( "INSERT INTO Students VALUES (8, 'Olivia Davis', 34, 3)" )
    cursor.execute ( "INSERT INTO Students VALUES (9, 'William Miller', 29, 6)" )
    cursor.execute ( "INSERT INTO Students VALUES (10, 'Ava Wilson', 25, 6)" )
    cursor.execute ( "INSERT INTO Students VALUES (11, 'Ethan Wilson', 22, 6)" )

    # Insert data into Programs table
    cursor.execute ( "INSERT INTO Programs VALUES (1, 'Data Science', 'Mr. Thompson', 2)" )
    cursor.execute ( "INSERT INTO Programs VALUES (2, 'Philosophy', 'Mrs. Williams', 4)" )
    cursor.execute ( "INSERT INTO Programs VALUES (3, 'Mechanical Engineering', 'Mr. Davis', 5)" )
    cursor.execute ( "INSERT INTO Programs VALUES (4, 'Biology', 'Mrs. Miller', 8)" )
    cursor.execute ( "INSERT INTO Programs VALUES (5, 'Law', 'Mr. Wilson', 7)" )
    cursor.execute ( "INSERT INTO Programs VALUES (6, 'Computer Science', 'Mr. Brown', 6)" )

    # Insert data into Classrooms table
    cursor.execute ( "INSERT INTO Classrooms VALUES (1, 30, 1)" )
    cursor.execute ( "INSERT INTO Classrooms VALUES (2, 50, 2)" )
    cursor.execute ( "INSERT INTO Classrooms VALUES (3, 40, 2)" )
    cursor.execute ( "INSERT INTO Classrooms VALUES (4, 60, 3)" )
    cursor.execute ( "INSERT INTO Classrooms VALUES (5, 30, 1)" )
    cursor.execute ( "INSERT INTO Classrooms VALUES (6, 50, 2)" )
    cursor.execute ( "INSERT INTO Classrooms VALUES (7, 60, 4)" )
    cursor.execute ( "INSERT INTO Classrooms VALUES (8, 50, 3)" )

    # Commit the changes and close the connection
    connection.commit ( )
    connection.close ( )

    print ( "Database created!" )


# Let's create our own function to make this process easier

def execute_query ( query , database="university.db" ) :
    connection = sqlite3.connect ( database )
    df = pd.read_sql ( query , connection )
    connection.close ( )

    return df

Creating database...
Database created!

### Database description

In this case we will have a Database called `universitiy.db` with 3 tables: `Students`, `Programs` and `Classrooms`.

The `Students` table will have the following columns:
- `Student_ID` (integer, primary key)
- `Student_Name` (text)
- `Age` (integer)
- `Program_ID` (integer, foreign key from `Programs` table)

The `Programs` table will have the following columns:
- `Program_ID` (integer, primary key)
- `Program_Name` (text)
- `Coordinator` (text)
- `Classroom_ID` (integer, foreign key from `Classrooms` table)

The `Classrooms` table will have the following columns:
- `Classroom_ID` (integer, primary key)
- `Capacity` (integer)
- `TV_Monitors` (integer)

#### Ex 1.

Take a look at every table in the database by querying all of it one by one: Students, Programs, Classrooms

In [2]:
  #List of all Students
query = """
        SELECT *
        FROM Students;
"""
df = execute_query ( query )
df

    Student_ID     Student_Name  Age  Program_ID
0            1         John Doe   25           1
1            2         Jane Doe   21           1
2            3       Mike Smith   26           2
3            4     Emma Johnson   19           2
4            5     Oliver Brown   24           2
5            6  Sophia Williams   36           3
6            7      James Jones   45           3
7            8     Olivia Davis   34           3
8            9   William Miller   29           6
9           10       Ava Wilson   25           6
10          11     Ethan Wilson   22           6

In [4]:
  #List of all Programs
query = """
        SELECT *
        FROM programs;
"""
df = execute_query ( query )
df

   Program_ID            Program_Name Coordinator_Name  Classrooms_ID
0           1            Data Science     Mr. Thompson              2
1           2              Philosophy    Mrs. Williams              4
2           3  Mechanical Engineering        Mr. Davis              5
3           4                 Biology      Mrs. Miller              8
4           5                     Law       Mr. Wilson              7
5           6        Computer Science        Mr. Brown              6

In [5]:
  #List of all Classrooms
query = """
        SELECT *
        FROM Classrooms;
"""
df = execute_query ( query )
df

   Classroom_ID  Capacity  TV_Monitors
0             1        30            1
1             2        50            2
2             3        40            2
3             4        60            3
4             5        30            1
5             6        50            2
6             7        60            4
7             8        50            3

#### Ex 2.

Develop the 3 queries to answer the following questions:

- How many students are there in the database, count the number of rows? 
- What is the average age of all the students?
- What is the maximum capacity of all the classrooms?

In [6]:
  # your code here
#Number of Student in the Database =Number of row because each row corresponds to  a unique student (Primary key)
query = """
      SELECT COUNT(*) as Number_Of_Student
      FROM Students;
"""
df = execute_query ( query )
df

   Number_Of_Student
0                 11

In [7]:
  #Average Age of the Students
#I AM USING ROUND TO REMOVE DECIMAL FROM AGE 
query = """
      SELECT ROUND (AVG(AGE),0) as Age_Average
      FROM Students;  
"""
df = execute_query ( query )
df

   Age_Average
0         28.0

In [8]:
  #SELEC MAX CAPACITY OF CLASSROOM
query = """
      SELECT MAX (Capacity) as Max_Capacity
      FROM Classrooms;  
"""
df = execute_query ( query )
df

   Max_Capacity
0            60

#### Ex 3.

Develop a query that contains the Programs info with the Classroom where they take place. Specifically we want the Program Name, The Program Coordinator, the Classroom ID, and Classroom TV Monitors (INNER JOIN).

In [3]:
  # your code here
query = """
     SELECT Programs.Program_Name,Programs.Coordinator_Name,Classrooms.Classroom_ID,Classrooms.TV_Monitors
     FROM  Programs 
     INNER JOIN Classrooms
     ON  Classrooms.Classroom_ID=Programs.Classrooms_ID; 
"""
df = execute_query ( query )
df

             Program_Name Coordinator_Name  Classroom_ID  TV_Monitors
0            Data Science     Mr. Thompson             2            2
1              Philosophy    Mrs. Williams             4            3
2  Mechanical Engineering        Mr. Davis             5            1
3                 Biology      Mrs. Miller             8            3
4                     Law       Mr. Wilson             7            4
5        Computer Science        Mr. Brown             6            2

#### Ex 4.

What is the average age of the Students in the Program 'Computer Science' (INNER JOIN)?

In [10]:
  # your code here
query = """
    SELECT AVG (Students.Program_ID) AS Average_Student,Programs.Program_Name as Programs_Name
    FROM  Students 
    LEFT OUTER JOIN  Programs 
    ON  Students.Program_ID=Programs.Program_ID 
    WHERE Programs.Program_Name like 'Computer Science';
"""
df = execute_query ( query )
df

   Average_Student     Programs_Name
0              6.0  Computer Science